RDVMI.rdvmi-ext/src/Catalogs/рдв_ВыгружаемыеОбъекты/рдв_ВыгружаемыеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_ВыгружаемыеОбъекты</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.рдв_ТипыВыгружаемыхОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборНабораЗаписей</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RDVMI.rdvmi-ext/src/Enums/рдв_ТипыВыгружаемыхОбъектов/рдв_ТипыВыгружаемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ТипыВыгружаемыхОбъектов</name>
  <enumValues>
    <name>Ссылка</name>
  </enumValues>
  <enumValues>
    <name>НаборЗаписей</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Catalogs/рдв_ВыгружаемыеОбъекты/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	СформироватьНаименование();
	
КонецПроцедуры

Процедура СформироватьНаименование()
	
	Если Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Произвольный Тогда
		Наименование = ИдентификаторДанных;
	ИначеЕсли Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка Тогда
		Наименование = СсылкаНаОбъект;
	Иначе
		Наименование = "";
		Для Каждого ЭлементОтбора Из ОтборНабораЗаписей Цикл
			Наименование = Наименование + ЭлементОтбора.Имя+": "+ЭлементОтбора.Значение+", ";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
